scripts/接口入参格式化/originXmlInParam.xml

<v:Envelope xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:d="http://www.w3.org/2001/XMLSchema" xmlns:c="http://schemas.xmlsoap.org/soap/encoding/" xmlns:v="http://schemas.xmlsoap.org/soap/envelope/"><v:Header><n0:token xmlns:n0="http://ws.nis.ewell/">eyJhbGciOiJIUzI1NiJ9.eyJleHAiOjE2OTU4ODA2MzcsImlhdCI6MTY5NTc5NDIzNywianRpIjoiMjA2OWE0MTItZDgyZC00ODBkLWFlNTgtYTNiYjkzZDZkNTM3IiwidXNlcm5hbWUiOiJkYmEifQ.sb6gk_WaZcK-TIOpy-yTyEXlw0Bx_UeijnoHwT77CV4</n0:token><n1:hospitalId xmlns:n1="http://ws.nis.ewell/">1</n1:hospitalId><n2:clientIP xmlns:n2="http://ws.nis.ewell/">10.111.2.192</n2:clientIP></v:Header><v:Body><n3:getOffLineUpLoadErrorOrderList id="o0" c:root="1" xmlns:n3="http://ws.nis.ewell/"><patientUids i:type="d:anyType"><patientUidList i:type="d:string">P-535888230384471</patientUidList><patientUidList i:type="d:string">P-494030220586081</patientUidList><patientUidList i:type="d:string">P-542503230448411</patientUidList><patientUidList i:type="d:string">P-542200230445601</patientUidList><patientUidList i:type="d:string">P-541418230438161</patientUidList><patientUidList i:type="d:string">P-537955230404451</patientUidList><patientUidList i:type="d:string">P-494607220591641</patientUidList><patientUidList i:type="d:string">P-540650230430771</patientUidList><patientUidList i:type="d:string">P-537706230402011</patientUidList><whatEverUserCanUnLockFlag i:type="d:boolean">false</whatEverUserCanUnLockFlag></patientUids><cliCode i:type="d:string">LunaMobile</cliCode><updateNo i:type="d:int">0</updateNo></n3:getOffLineUpLoadErrorOrderList></v:Body></v:Envelope>